'number' + 3 + 3 
/*результат 'number33'
тут спрацьовувавє конкатенація - обчислювання починається зліва направо - 'number'+3 - результат 'number3'- і потім 'number3'+ 3    */


null + 3
/*результат 3
null приводиться до числа 0 - тому 0+3 - результат 3     */


5 && "qwerty"
/*результат "qwerty"
оператор && перевіряє всі значення на тру, перший це число 5, тобто тру, рядок не пустий це також тру, але якщо всі значення тру, 
то повертає самий останні тру, тому результат "qwerty"     */


+'40' + +'2' + "hillel"
/*результат '42hillel'
унарний плюс перетворює рядок на число тому вираз приймає значення 40 + 2 + "hillel" - 42 + "hillel" - далі конкатенація - результат "42hillel"   */ 


'10' - 5 === 6
/*результат false
рядок '10' приводиться до числа, 10 - 5 = 5, далі порівняння 5===6, 5 не дорівнює 6, тому false   */


true + false
/*результат 1
true та false перетворюються у число, тому 1+0 = 1   */


'4px' - 3
/*результат NaN
рядок '4px' не може перетворитися на число тому що в рядку є символи, тому строка перетворюється на NaN, далі NaN - 3, люба арифметична дія з NaN видає NaN   */


'4' - 3
/*результат 1
при відніманні нема конкатенації - строка '4' перетворюється на число - тому 4-3 = 1   */


'6' + 3 ** 0
/*результат '61'
спочатку 3 в нульової степені, буде дорівнювати 1, тому вираз вже має вигляд як '6' + 1, тут конкатенація, тому результат строка 61    */


12 / '6'
/*результат 2
рядок 6 перетворюється на число 6, далі 12 ділимо на 6, результат 2    */


'10' + (5 === 6)
/*результат '10false`
спочатку виконується дія в душках - 5 не дорівнює 6, тому false, вираз приймає вигляд '10' + false, конкатенація і на результат '10false`   */


null == ''
/*результат false
null дорівнює тільки самому собі та undefined, тому в даному випадку результат false   */ 


3 ** (9 / 3)
/*результат 27
спочатку виконується дія в душках, 9/3=3, вираз виглядає 3 ** 3, це три в третій степені, результат 27     */


!!'false' == !!'true'
/*результат true
маємо рядки 'false' та 'true', знак !! перетворює любе значення на булеве, а рядок не пустий це тру, тому маємо true == true, а це правда, тому результат true    */



0 || '0' && 1
/*результат 1
оператор && має приоритет, тому виконуємо '0' && 1, тут всі значення тру, тому повертається остання значення, це 1, далі 0 || 1, 
оператор або повертає перше значення тру, 0 це фолс, 1 тру, тому результат 1     */


(+null == false) < 1;
/*результат false
унарний + перетворює null в число 0, далі вираз виглядає (0==false), в такому випадку коли є число то false теж перетворюється в число, тобто 0==0, а це true, 
true<1, true перетворюється в 1, порівняння приймає вираз 1 < 1, а це false     */


false && true || true
/*результат true
спочатку виконується оператор &&, маємо false && true, оператор повертає перше значення false якщо такий є, в цьому випадку він є, 
тому результат цього виразу false, маємо false || true, оператор або повертає перше значення true якщо таке є, тому результат true     */


false && (false || true)
/*результат false
спочатку виконується оператор або бо він в душках, false || true, оператор або повертає перше значення true якщо таке є, тому результат true, 
вираз вже false && true, оператор && повертає перше значення false якщо такий є, в цьому випадку він є, тому загальний результат false     */



(+null == false) < 1 ** 5  
/*результат false 
унарний + перетворює null в число 0, далі вираз виглядає (0==false), в такому випадку коли є число то false теж перетворюється в число, 
тобто 0 == 0, а це true, тобто наступний вигляд true < 1 ** 5, підносимо 1 в 5 степінь і отримуємо 1, далі рівняння виглядає як true < 1, 
true перетворюється в 1, порівняння приймає вираз 1 < 1, а це false     */



